Repository: NolanLiogier/gsb-feedback-mobile-app
Catalog: frontend/lib/l10n/app_*.arb
Languages: fr

# appTitle
source: GSB App
fr: Application GSB

source: Welcome
fr: Bienvenue

source: Locale test
fr: Test de langue

# switchToEnglish
source: English
fr: Anglais

# switchToFrench
source: Fran√ßais
fr: Français

source: Current: {locale}
fr: Actuel : {locale}

# loginTitle
source: LOGIN
fr: Connexion

# loginSubtitle
source: Account given by GSB administrator
fr: Compte donné par l'administrateur GSB

# loginEmailHint
source: name.surname@gsb.fr
fr: nom.prenom@gsb.fr

# loginPasswordLabel
source: PASSWORD
fr: MOT DE PASSE

# loginPasswordHint
source: Enter your password
fr: Mot de passe

# loginButton
source: Log in
fr: Se connecter

# loginForgotPassword
source: Forgot password?
fr: Mot de passe oublié ?

# loginErrorRequired
source: Email and password are required
fr: Email et mot de passe requis

# loginSuccessDefault
source: Login successful
fr: Connexion réussie

# loginErrorDefault
source: Request failed
fr: Échec de la requête

# appBarLogout
source: Log out
fr: Déconnexion

# visitsTitle
source: List of Visits
fr: Liste des Visites

# visitsSearchHint
source: Search for a visit...
fr: Rechercher une visite...

# visitsUserNotFound
source: User not found
fr: Utilisateur introuvable

# visitsLoadError
source: Failed to load visits
fr: Échec du chargement des visites

# visitsEmpty
source: No visits
fr: Aucune visite

# visitsNoResults
source: No results
fr: Aucun résultat

# navVisits
source: Visits
fr: Visites

# visitDetailsTitle
source: Visit Details
fr: Détails de la Visite

# visitDetailsInvalidData
source: Invalid data
fr: Données invalides

# visitDetailsLoadError
source: Unable to load
fr: Chargement impossible

# visitDetailsError
source: Error
fr: Erreur

# visitDetailsCurrentStatus
source: CURRENT STATUS
fr: STATUT ACTUEL

# visitDetailsGeneralInfo
source: GENERAL INFORMATION
fr: INFORMATIONS GÉNÉRALES

# visitDetailsVisitDate
source: Visit date
fr: Date de la visite

# visitDetailsTimeSlot
source: Time slot
fr: Créneau horaire

# visitDetailsPracticeLocation
source: Practice location
fr: Localisation du cabinet

# visitDetailsAssignedVisitor
source: ASSIGNED VISITOR
fr: VISITEUR ASSIGNÉ

# visitDetailsComment
source: COMMENT
fr: COMMENTAIRE

# visitDetailsCreationDate
source: Creation date
fr: Date de création

# visitDetailsRatingLabel
source: Your rating
fr: Votre note

# newVisitTitle
source: Create a Visit
fr: Créer une Visite

# newVisitStep1SelectCompany
source: Practitioner / Establishment
fr: Praticien / Établissement

# newVisitCompanyLabel
source: Company
fr: Établissement

# newVisitSelectCompanyHint
source: Select a company
fr: Sélectionner un établissement

# newVisitStep1SelectHint
source: Select a practitioner
fr: Sélectionner un praticien

# newVisitCancel
source: Cancel
fr: Annuler

# newVisitContinue
source: Continue
fr: Continuer

# newRequestHeading
source: New Request
fr: Nouvelle Demande

# newRequestSubtitle
source: Please fill in the information regarding your next medical visit.
fr: Veuillez remplir les informations concernant votre prochaine visite médicale.

# newVisitVisitDate
source: Date of the visit
fr: Date de la visite

# newVisitObjective
source: Objective of the visit
fr: Objectif de la visite

# newVisitObjectiveHint
source: Describe the main objective and the products to present...
fr: Décrivez l'objectif principal et les produits à présenter...

# newVisitSendRequest
source: Create visit
fr: Créer la visite

# newVisitLoadCompaniesError
source: Failed to load companies
fr: Échec du chargement des établissements

# newVisitLoadDataError
source: Failed to load form data
fr: Échec du chargement des données

# newVisitCreateError
source: Failed to create visit
fr: Échec de la création de la visite

# newVisitCreateSuccess
source: Visit created successfully
fr: Visite créée avec succès

# newVisitSelectCompanyFirst
source: Please select a company
fr: Veuillez sélectionner un établissement

# newVisitTitleRequired
source: Title is required
fr: Le titre est requis

# newVisitVisitorRequired
source: Please select a GSB visitor
fr: Veuillez sélectionner un visiteur GSB

# newVisitEmployeeRequired
source: Please select a client
fr: Veuillez sélectionner un client

# newVisitSelectVisitor
source: Select a visitor
fr: Sélectionner un visiteur

# newVisitSelectProduct
source: Select a product
fr: Sélectionner un produit

# newVisitGsbVisitorLabel
source: GSB Visitor
fr: Visiteur GSB

# newVisitSelectEmployee
source: Select a client
fr: Sélectionner un client

# newVisitProductLabel
source: Product
fr: Produit

# newVisitFormTitleLabel
source: Visit title
fr: Titre de la visite

# visitDetailsFeedbackBtn
source: Feedback
fr: Avis

# visitDetailsDeleteBtn
source: Delete
fr: Supprimer

# visitDetailsDeleteConfirmTitle
source: Delete visit?
fr: Supprimer la visite ?

# visitDetailsDeleteConfirmMessage
source: This visit will be permanently deleted.
fr: Cette visite sera définitivement supprimée.

# visitDetailsDeleteSuccess
source: Visit deleted
fr: Visite supprimée

# visitDetailsDeleteError
source: Failed to delete visit
fr: Échec de la suppression

# visitFeedbackTitle
source: Visit Report
fr: Compte-rendu de visite

# visitFeedbackReportTitle
source: VISIT REPORT
fr: RAPPORT DE VISITE

# visitFeedbackYourOpinion
source: YOUR OPINION
fr: VOTRE AVIS

# visitFeedbackRateLabel
source: RATE THIS CONSULTATION
fr: NOTEZ CETTE CONSULTATION

# visitFeedbackAdditionalComments
source: ADDITIONAL COMMENTS
fr: COMMENTAIRES ADDITIONNELS

# visitFeedbackCommentHint
source: What did you think of this visit?
fr: Qu'avez-vous pensé de cette visite?

# visitFeedbackSendBtn
source: Send Feedback
fr: Envoyer l'avis

# visitFeedbackLoadError
source: Failed to load visit
fr: Échec du chargement

# visitFeedbackSubmitError
source: Failed to send feedback
fr: Échec de l'envoi de l'avis

# visitsFeedbackSuccess
source: Feedback sent
fr: Avis envoyé
